[
  {
    "image": "/images/case-study-1.jpg",
    "heading": "E-commerce Website for Fashion Retailer",
    "paragraph": "Built a modern, responsive e-commerce platform that increased online sales by 150% and improved user experience.",
    "extraParagraphs": [
      "Implemented secure payment processing and inventory management system.",
      "Designed intuitive navigation and mobile-optimized checkout process.",
      "Integrated analytics to track customer behavior and optimize conversions."
    ]
  },
  {
    "image": "/images/case-study-2.jpg",
    "heading": "Corporate Website Redesign",
    "paragraph": "Redesigned a corporate website with modern aesthetics and improved functionality, resulting in 40% increase in lead generation.",
    "extraParagraphs": [
      "Created a responsive design that works seamlessly across all devices.",
      "Implemented SEO best practices to improve search engine rankings.",
      "Added content management system for easy updates and maintenance."
    ]
  },
  {
    "image": "/images/case-study-3.jpg",
    "heading": "Restaurant Web Application",
    "paragraph": "Developed a comprehensive web application for restaurant management with online ordering and reservation system.",
    "extraParagraphs": [
      "Built custom online ordering system with real-time order tracking.",
      "Integrated table reservation system with automated confirmations.",
      "Created admin dashboard for menu management and analytics."
    ]
  },
  {
    "image": "/images/case-study-4.png",
    "heading": "Healthcare Portal Development",
    "paragraph": "Created a secure patient portal for healthcare providers with appointment scheduling and medical records access.",
    "extraParagraphs": [
      "Implemented HIPAA-compliant security measures for patient data protection.",
      "Developed user-friendly interface for patients and healthcare providers.",
      "Integrated with existing medical systems for seamless data synchronization."
    ]
  },
  {
    "image": "/images/case-study-5.png",
    "heading": "Educational Platform",
    "paragraph": "Built an interactive learning platform with course management and student progress tracking features.",
    "extraParagraphs": [
      "Created multimedia content delivery system for engaging learning experience.",
      "Implemented student progress tracking and certificate generation.",
      "Developed responsive design for learning on any device."
    ]
  },
  {
    "image": "/images/case-study-6.jpg",
    "heading": "Real Estate Web Platform",
    "paragraph": "Developed a comprehensive real estate platform with property listings, virtual tours, and lead management.",
    "extraParagraphs": [
      "Integrated property search with advanced filtering and map integration.",
      "Created virtual tour functionality using 360-degree photography.",
      "Built CRM system for managing leads and client communications."
    ]
  }
]